# Importing and manipulating data with Pandas

In [1]:
# Import packages
import pandas as pd

In [2]:
# Path to CSV file and CSV filename
csv_file = 'data/amount-data.csv'

In [3]:
# Read the CSV file using pandas
# This function automatically parses the csv format and nicely organizes the data in an indexed structure called DataFrame.
df = pd.read_csv(csv_file)

In [4]:
# Display the data
df

          day  amount
0  2013-01-24   323.0
1  2013-01-25   233.0
2  2013-01-26   433.0
3  2013-01-27   555.0
4  2013-01-28   123.0
5  2013-01-29     NaN
6  2013-01-30   221.0

In [5]:
# Display the type of the data
type(df)

pandas.core.frame.DataFrame

In [6]:
# See the top three rows
df.head(3)

          day  amount
0  2013-01-24   323.0
1  2013-01-25   233.0
2  2013-01-26   433.0

In [7]:
# See the last three rows
df.tail(3)

          day  amount
4  2013-01-28   123.0
5  2013-01-29     NaN
6  2013-01-30   221.0

In [8]:
# Info about the data
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 7 entries, 0 to 6
Data columns (total 2 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   day     7 non-null      object
 1   amount  6 non-null      float64
dtypes: float64(1), object(1)
memory usage: 244.0+ bytes

In [9]:
# Generate descriptive statistics
df.describe()

           amount
count    6.000000
mean   314.666667
std    157.487354
min    123.000000
25%    224.000000
50%    278.000000
75%    405.500000
max    555.000000

In [10]:
# Display the columns
df.columns

Index(['day', 'amount'], dtype='object')

In [11]:
# Display the datatype for each column
df.dtypes

day        object
amount    float64
dtype: object

In [12]:
# Display specific columns from the dataframe
df['amount']

0    323.0
1    233.0
2    433.0
3    555.0
4    123.0
5      NaN
6    221.0
Name: amount, dtype: float64

In [13]:
df.amount

0    323.0
1    233.0
2    433.0
3    555.0
4    123.0
5      NaN
6    221.0
Name: amount, dtype: float64

In [15]:
# Select multiple columns
df[['day', 'amount']]

          day  amount
0  2013-01-24   323.0
1  2013-01-25   233.0
2  2013-01-26   433.0
3  2013-01-27   555.0
4  2013-01-28   123.0
5  2013-01-29     NaN
6  2013-01-30   221.0

In [14]:
# Select multiple columns
column_list = ['day', 'amount']

df[column_list]

          day  amount
0  2013-01-24   323.0
1  2013-01-25   233.0
2  2013-01-26   433.0
3  2013-01-27   555.0
4  2013-01-28   123.0
5  2013-01-29     NaN
6  2013-01-30   221.0

In [ ]:
# Calculate mean
df['amount'].mean()

np.float64(314.6666666666667)

In [18]:
# Calculate stand deviation
df['amount'].std()

np.float64(157.48735398966696)

In [19]:
# Min amount
df['amount'].min()

np.float64(123.0)

In [20]:
# Max amount
df['amount'].max()

np.float64(555.0)

# Open a remote file or database like a CSV

In [21]:
# Opening a remote CSV file
url = 'https://gist.githubusercontent.com/kevin336/acbb2271e66c10a5b73aacf82ca82784/raw/e38afe62e088394d61ed30884dd50a6826eee0a8/employees.csv'
df_remote_data = pd.read_csv(url)

# Display the top few rows
df_remote_data.head()

,EMPLOYEE_ID,FIRST_NAME,LAST_NAME,EMAIL,PHONE_NUMBER,HIRE_DATE,JOB_ID,SALARY,COMMISSION_PCT,MANAGER_ID,DEPARTMENT_ID
0,198,Donald,OConnell,DOCONNEL,650.507.9833,21-JUN-07,SH_CLERK,2600,-,124,50
1,199,Douglas,Grant,DGRANT,650.507.9844,13-JAN-08,SH_CLERK,2600,-,124,50
2,200,Jennifer,Whalen,JWHALEN,515.123.4444,17-SEP-03,AD_ASST,4400,-,101,10
3,201,Michael,Hartstein,MHARTSTE,515.123.5555,17-FEB-04,MK_MAN,13000,-,100,20
4,202,Pat,Fay,PFAY,603.123.6666,17-AUG-05,MK_REP,6000,-,201,20

In [22]:
# Select specific columns
df_remote_data2 = df_remote_data[['EMAIL', 'SALARY']]

In [24]:
# Return the top 5 rows
df_remote_data2.head()

      EMAIL  SALARY
0  DOCONNEL    2600
1    DGRANT    2600
2   JWHALEN    4400
3  MHARTSTE   13000
4      PFAY    6000

In [26]:
# Apply filters to dataframe
# get rows where salary is less than 2600
df_remote_data2[df_remote_data2['SALARY'] < 2600]

       EMAIL  SALARY
28  KCOLMENA    2500
36   JLANDRY    2400
37   SMARKLE    2200
40   JAMRLOW    2500
41   TJOLSON    2100
44      KGEE    2400
45  HPHILTAN    2200
49    JPATEL    2500

In [ ]:
# Apply filters to dataframe
# get rows where salary is more than 2600
df_remote_data2[df_remote_data2['SALARY'] > 2600]

       EMAIL  SALARY
2    JWHALEN    4400
3   MHARTSTE   13000
4       PFAY    6000
5    SMAVRIS    6500
6      HBAER   10000
7   SHIGGINS   12008
8     WGIETZ    8300
9      SKING   24000
10  NKOCHHAR   17000
11   LDEHAAN   17000
12   AHUNOLD    9000
13    BERNST    6000
14   DAUSTIN    4800
15  VPATABAL    4800
16  DLORENTZ    4200
17  NGREENBE   12008
18   DFAVIET    9000
19     JCHEN    8200
20  ISCIARRA    7700
21   JMURMAN    7800
22     LPOPP    6900
23  DRAPHEAL   11000
24     AKHOO    3100
25    SBAIDA    2900
26   STOBIAS    2800
29    MWEISS    8000
30    AFRIPP    8200
31  PKAUFLIN    7900
32  SVOLLMAN    6500
33  KMOURGOS    5800
34    JNAYER    3200
35  IMIKKILI    2700
38   LBISSOT    3300
39  MATKINSO    2800
42   JMALLIN    3300
43   MROGERS    2900
46   RLADWIG    3600
47   SSTILES    3200
48      JSEO    2700